src/tests/data/billing/stripe_mock_data.json

{
    "stripe.Customer.create": {
        "id": "cus_4fdAW5ftNQow1a"
    },
    "stripe.Customer.create_source": {
        "id": "card_4fdAW5ftNQow1a",
        "last4": "4242"
    },
    "stripe.Customer.modify_source": null,
    "stripe.Charge.create": {
        "id": "ch_4fdAW5ftNQow1a",
        "amount": 1000,
        "currency": "usd",
        "status": "succeeded",
        "receipt_url": "https://pay.stripe.com/receipts/acct_1032D82eZvKYlo2C/ch_4fdAW5ftNQow1a/rcpt_4fdAW5ftNQow1a"
    },
    "stripe.Charge.retrieve": {
        "status": "succeeded"
    }
}